In [46]:
import numpy as np
import pandas as pd

In [47]:
dict1 ={
    "name": ['harry','rohan','skillf','shubh'],
    "marks":[92,34,24,17],
    "city":['rampur','delhi','bareilly','shamli']
    
}

In [48]:
df = pd.DataFrame(dict1)

In [49]:
df

     name  marks      city
0   harry     92    rampur
1   rohan     34     delhi
2  skillf     24  bareilly
3   shubh     17    shamli

In [50]:
df.to_csv('friends.csv')

In [51]:
df.to_csv('friends_index_false.csv', index=False)

In [52]:
df.head(2)

    name  marks    city
0  harry     92  rampur
1  rohan     34   delhi

In [53]:
df.tail(2)

     name  marks      city
2  skillf     24  bareilly
3   shubh     17    shamli

In [54]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [55]:
sarah = pd.read_csv('sarah.csv')

In [56]:
sarah

   Unnamed: 0  Train No  Speed      City
0           0     12438     34    rampur
1           1     34589    123     dehli
2           2      9875     56  bareilly
3           3    123467     78    shamli

**What is Pandas?**

*Pandas is an open source data anazlysis library written in python.*

*It leverage the power and speed of numpy to make data analysis and preprocessing.*

*It provides rich and highly robust data operations.*

**Pandas has two  types of data structures:**

*1st Series - It's one dimensional array with indexes, it stores a single column or row of data in a Dataframe*

*2nd Dataframe - It's a tabular spreadsheet like structure representing rows each of which contains one or multiple columns*

*A one-dimensional array capable of holding any type of data-Series*

*A two-dimensional data structure with columns of potentially different types of data- Dataframe*